## Part 1: Explore the Data

Import the data and use Pandas to learn more about the dataset.

In [280]:
import pandas as pd

df = pd.read_csv('Resources/client_dataset.csv')
df.head()

,first,last,job,phone,email,client_id,order_id,order_date,order_week,order_year,item_id,category,subcategory,unit_price,unit_cost,unit_weight,qty,line_number
0,Donald,Harding,Immunologist,793-904-7725x39308,harding.donald.7185@sullivan.com,58515,8953482,2023-04-28,17,2023,EUD29711-63-6U,decor,wall art,1096.80,762.71,7.50,105,1
1,Tiffany,Myers,Music therapist,201.442.4543x942,myers.t.6537@ferguson-johnson.net,37609,8069089,2023-05-19,20,2023,XDA18116-89-4A,consumables,pens,24.95,15.09,1.49,21,0
2,Shannon,Watson,Immunologist,687.737.9424x8503,swatson8146@payne.net,57113,1902144,2023-01-29,4,2023,ABE59463-05-7E,software,project management,13.52,7.86,1.68,39,6
3,Nathan,Baker,Accounting technician,827-788-8123x012,bakernathan@benson.com,46554,9031802,2023-04-25,17,2023,ZMM00836-65-0C,consumables,pens,36.42,24.85,1.23,29,3
4,Christina,Schwartz,Chiropractor,265-829-3643,christinaschwartz9252@mcconnell.com,92089,1322274,2023-05-28,21,2023,BZX55559-12-3X,consumables,misc,195.10,108.17,46.43,20,1

In [282]:
# View the column names in the data
df.columns

Index(['first', 'last', 'job', 'phone', 'email', 'client_id', 'order_id',
       'order_date', 'order_week', 'order_year', 'item_id', 'category',
       'subcategory', 'unit_price', 'unit_cost', 'unit_weight', 'qty',
       'line_number'],
      dtype='object')

In [284]:
# Use the describe function to gather some basic statistics
df.describe

<bound method NDFrame.describe of            first       last                      job               phone  \
0         Donald    Harding             Immunologist  793-904-7725x39308
1        Tiffany      Myers          Music therapist    201.442.4543x942
2        Shannon     Watson             Immunologist   687.737.9424x8503
3         Nathan      Baker    Accounting technician    827-788-8123x012
4      Christina   Schwartz             Chiropractor        265-829-3643
...          ...        ...                      ...                 ...
54634     Lauren      Reese           Radio producer  977.877.5272x11382
54635    Derrick      Moore                 Musician        358.661.5483
54636     Monica  Gutierrez         Graphic designer    294.805.9100x339
54637      Wanda    Solomon             Toxicologist       (311)767-4924
54638     Dwayne       Bell  Chief Financial Officer   606-619-7667x9508

                                     email  client_id  order_id  order_date  \
0         harding.donald.7185@sullivan.com      58515   8953482  2023-04-28
1        myers.t.6537@ferguson-johnson.net      37609   8069089  2023-05-19
2                    swatson8146@payne.net      57113   1902144  2023-01-29
3                   bakernathan@benson.com      46554   9031802  2023-04-25
4      christinaschwartz9252@mcconnell.com      92089   1322274  2023-05-28
...                                    ...        ...       ...         ...
54634   late_reese_4081@montoya-chavez.org      29043   9021716  2023-04-26
54635         derrick.moore.2602@pope.info      41908   6290153  2023-02-08
54636            gutierrezm3195@morris.org      35176   8692622  2023-03-05
54637            solomonwanda5962@ross.org      24485   7592730  2023-01-18
54638                     belld@galvan.com      24007   7489403  2023-01-04

       order_week  order_year         item_id     category  \
0              17        2023  EUD29711-63-6U        decor
1              20        2023  XDA18116-89-4A  consumables
2               4        2023  ABE59463-05-7E     software
3              17        2023  ZMM00836-65-0C  consumables
4              21        2023  BZX55559-12-3X  consumables
...           ...         ...             ...          ...
54634          17        2023  UCA28532-31-0B     software
54635           6        2023  EBD29277-23-7U  consumables
54636           9        2023  EBD30093-55-9Z  consumables
54637           3        2023  XMZ38239-49-3D    furniture
54638           1        2023  ZCZ05589-50-5D     software

              subcategory  unit_price  unit_cost  unit_weight   qty  \
0                wall art     1096.80     762.71         7.50   105
1                    pens       24.95      15.09         1.49    21
2      project management       13.52       7.86         1.68    39
3                    pens       36.42      24.85         1.23    29
4                    misc      195.10     108.17        46.43    20
...                   ...         ...        ...          ...   ...
54634           logistics       83.13      51.60         2.25    33
54635    kitchen supplies      206.59     175.46        11.70    47
54636   bathroom supplies       65.66      57.31         4.16   475
54637              stands        1.48       1.22        18.04   112
54638  project management        3.01       1.61         2.07  1031

       line_number
0                1
1                0
2                6
3                3
4                1
...            ...
54634            8
54635            0
54636            6
54637            0
54638            5

[54639 rows x 18 columns]>

In [286]:
# Use this space to do any additional research
# and familiarize yourself with the data.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54639 entries, 0 to 54638
Data columns (total 18 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first        54639 non-null  object
 1   last         54639 non-null  object
 2   job          54639 non-null  object
 3   phone        54639 non-null  object
 4   email        54639 non-null  object
 5   client_id    54639 non-null  int64
 6   order_id     54639 non-null  int64
 7   order_date   54639 non-null  object
 8   order_week   54639 non-null  int64
 9   order_year   54639 non-null  int64
 10  item_id      54639 non-null  object
 11  category     54639 non-null  object
 12  subcategory  54639 non-null  object
 13  unit_price   54639 non-null  float64
 14  unit_cost    54639 non-null  float64
 15  unit_weight  54639 non-null  float64
 16  qty          54639 non-null  int64
 17  line_number  54639 non-null  int64
dtypes: float64(3), int64(6), object(9)
memory usage: 7.5+ MB

In [288]:
# What three item categories had the most entries?
df['category'].value_counts().head(3)

category
consumables    23538
furniture      11915
software        8400
Name: count, dtype: int64

In [290]:
# For the category with the most entries, which subcategory had the most entries?
identifier = df['category'] == "consumables" 
identifier

df.loc[df['category']=='consumables', 'subcategory'].value_counts().head(1)

subcategory
bathroom supplies    6424
Name: count, dtype: int64

In [292]:
df2 = df.loc[identifier, 'subcategory']
df2.head()

1                pens
3                pens
4                misc
6    kitchen supplies
7                pens
Name: subcategory, dtype: object

In [294]:
df3 = df2.value_counts()

In [296]:
df3.head(1)

subcategory
bathroom supplies    6424
Name: count, dtype: int64

In [298]:
df.loc[df['category']=='consumables', 'subcategory'].value_counts().head(1)

subcategory
bathroom supplies    6424
Name: count, dtype: int64

In [300]:
 df.loc[identifier ,'subcategory']

1                     pens
3                     pens
4                     misc
6         kitchen supplies
7                     pens
               ...
54629     kitchen supplies
54632       paper products
54633     kitchen supplies
54635     kitchen supplies
54636    bathroom supplies
Name: subcategory, Length: 23538, dtype: object

In [34]:
# Which five clients had the most entries in the data?
df['client_id'].value_counts().head(5)

client_id
33615    220
66037    211
46820    209
38378    207
24741    207
Name: count, dtype: int64

In [302]:
df['client_id'].value_counts().head(5).index

Index([33615, 66037, 46820, 38378, 24741], dtype='int64', name='client_id')

In [304]:
list(df['client_id'].value_counts().head(5).index)

[33615, 66037, 46820, 38378, 24741]

In [311]:
# Store the client ids of those top 5 clients in a list.
top_five_clients = list(df['client_id'].value_counts().head(5).index)
top_five_clients

[33615, 66037, 46820, 38378, 24741]

In [313]:
# How many total units (the qty column) did the client with the most entries order order?
df.loc[df['client_id']== 33615, 'qty'].sum()

64313

## Part 2: Transform the Data
Do we know that this client spent the more money than client 66037? If not, how would we find out? Transform the data using the steps below to prepare it for analysis.

In [315]:
# Create a column that calculates the subtotal for each line using the unit_price and the qty
df['line_subtotal'] = df.unit_price* df.qty
df[['unit_price','qty','line_subtotal']].head(2)

   unit_price  qty  line_subtotal
0     1096.80  105      115164.00
1       24.95   21         523.95

In [317]:
# Create a column for shipping price.
# Assume a shipping price of $7 per pound for orders over 50 pounds and $10 per pound for items 50 pounds or under.

df['total_weight']=df.unit_weight* df.qty

def calculate_shipping_price(total_weight):
    if total_weight >50:
        return total_weight * 7
    else:
        return total_weight * 10


df['shipping_price']= df['total_weight'].apply(calculate_shipping_price)
df[['unit_price','unit_weight','qty', 'total_weight', 'shipping_price']].head(3)

   unit_price  unit_weight  qty  total_weight  shipping_price
0     1096.80         7.50  105        787.50         5512.50
1       24.95         1.49   21         31.29          312.90
2       13.52         1.68   39         65.52          458.64

In [319]:
# Create a column for the total price using the subtotal and the shipping price along with a sales tax of 9.25%
df['line_price']=((df.line_subtotal+ df.shipping_price)*1.0925).round(2)

df[['line_subtotal','line_price', 'shipping_price']].head(3)

   line_subtotal  line_price  shipping_price
0      115164.00   131839.08         5512.50
1         523.95      914.26          312.90
2         527.28     1077.12          458.64

In [321]:
# Create a column for the cost of each line using unit cost, qty, and
# shipping price (assume the shipping cost is exactly what is charged to the client).
df['line_cost']=(df.unit_cost*df.qty)+df.shipping_price
df[['line_subtotal', 'total_weight','line_price', 'shipping_price','line_cost']].head(3)

   line_subtotal  total_weight  line_price  shipping_price  line_cost
0      115164.00        787.50   131839.08         5512.50   85597.05
1         523.95         31.29      914.26          312.90     629.79
2         527.28         65.52     1077.12          458.64     765.18

In [323]:
# Create a column for the profit of each line using line cost and line price

df['line_profit']=df.line_price-df.line_cost
df[['line_subtotal', 'total_weight','line_price', 'shipping_price','line_cost','line_profit']].head(3)

,line_subtotal,total_weight,line_price,shipping_price,line_cost,line_profit
0,115164.00,787.50,131839.08,5512.50,85597.05,46242.03
1,523.95,31.29,914.26,312.90,629.79,284.47
2,527.28,65.52,1077.12,458.64,765.18,311.94

## Part 3: Confirm your work
You have email receipts showing that the total prices for 3 orders. Confirm that your calculations match the receipts. Remember, each order has multiple lines.

Order ID 2742071 had a total price of \$152,811.89

Order ID 2173913 had a total price of \$162,388.71

Order ID 6128929 had a total price of \$923,441.25

In [325]:
# Check your work using the totals above
order_ids=[2742071,2173913,6128929]
for order in order_ids:
    price=df.loc[df['order_id'] == order , 'line_price'].sum().round(2)
    print(f'order {order} total {price}')

order 2742071 total 152811.89
order 2173913 total 162388.71
order 6128929 total 923441.25

## Part 4: Summarize and Analyze
Use the new columns with confirmed values to find the following information.

In [369]:
# How much did each of the top 5 clients by quantity spend? Check your work from Part 1 for client ids.
top_5=[33615, 66037, 46820, 38378, 24741]
for top5 in top_5:
    spend=df.loc[df['client_id'] == top5 , 'line_price'].sum().round(2)
    print(f'client {top5} total ${spend}')

client 33615 total $8377308.52
client 66037 total $10259514.79
client 46820 total $9743794.36
client 38378 total $12906550.87
client 24741 total $82268892.02

In [411]:
# Create a summary DataFrame showing the totals for the for the top 5 clients with the following information:
# total units purchased, total shipping price, total revenue, and total profit. 
summary_dict = {'client_id': top_5}
colunms=['qty', 'line_price', 'shipping_price', 'line_cost', 'line_profit']

for col in colunms:
    summary_dict[col] = [df.loc[df['client_id'] == client_id, col].sum() for client_id in top_5]
summary_dict_df = pd.DataFrame(summary_dict)
summary_dict_df

   client_id     qty   line_price  shipping_price    line_cost  line_profit
0      33615   64313   8377308.52      1828984.89   6175313.91   2201994.61
1      66037   43018  10259514.79      1395151.85   7004482.98   3255031.81
2      46820   75768   9743794.36      1601448.84   7007191.64   2736602.72
3      38378   73667  12906550.87      3429455.40   9634720.98   3271829.89
4      24741  239862  82268892.02      5126448.37  45688899.71  36579992.31

In [438]:
# Format the data and rename the columns to names suitable for presentation.
presentation_top_5 = summary_dict_df.rename(columns = {'client_id: 'Client ID','qty':'Units','shipping_price': 'Shipping (millions)',
'line_price': 'Total Revenue (millions)', 
'line_cost': 'Total Cost (millions)', 
'line_profit': 'Total Profit (millions)' })

SyntaxError: unterminated string literal (detected at line 2) (3956458768.py, line 2)

In [430]:

# Define the money columns. 
presentation_top_5

# Define a function that converts a dollar amount to millions.

# Apply the currency_format_millions function to only the money columns. 



# Rename the columns to reflect the change in the money format.

NameError: name 'presentation_top_5' is not defined

In [19]:
# Sort the updated data by "Total Profit (millions)" form highest to lowest and assign the sort to a new DatFrame.
sortedm

,Client ID,Units,Shipping (millions),Total Revenue (millions),Total Cost (millions),Total Profit (millions)
4,24741,239862,5.126448,82.268892,45.688900,36.579992
3,38378,73667,3.429455,12.906551,9.634721,3.271830
1,66037,43018,1.395152,10.259515,7.004483,3.255032
2,46820,75768,1.601449,9.743794,7.007192,2.736603
0,33615,64313,1.828985,8.377309,6.175314,2.201995